# 数据重构

In [3]:
import numpy as np
import pandas as pd

### stack
stack 将数据的列索引转为行索引
                   
                   
                   
unstack 将数据的行索引转为列索引

In [8]:
df_obj = pd.DataFrame(np.random.randint(0,10,(5,2)),columns=['data1','data2'])
print(df_obj)

   data1  data2
0      3      9
1      5      2
2      4      6
3      7      9
4      0      2

In [9]:
stacked=df_obj.stack()
print(stacked)

0  data1    3
   data2    9
1  data1    5
   data2    2
2  data1    4
   data2    6
3  data1    7
   data2    9
4  data1    0
   data2    2
dtype: int32

In [10]:
print(type(stacked))
print(type(stacked.index))

<class 'pandas.core.series.Series'>
<class 'pandas.core.indexes.multi.MultiIndex'>

In [11]:
#默认操作内层索引
stacked.unstack()

   data1  data2
0      3      9
1      5      2
2      4      6
3      7      9
4      0      2

In [12]:
#通过level指定操作索引的级别
stacked.unstack(level=0)

       0  1  2  3  4
data1  3  5  4  7  0
data2  9  2  6  9  2

In [13]:
stacked.unstack(level=1)

   data1  data2
0      3      9
1      5      2
2      4      6
3      7      9
4      0      2

#### 以上的操作具体分析stac索引k()函数  pivot(),pivot_table()的区别

pivot():轴向旋转
    
    
pivot(index,columns,values):将index指定为行索引  columns是列索引 value则是DataFrame中的值

In [14]:
#需求：对以下数据求每个学生的总成绩的平均分
a=[['刘玄德','男','语文',98.],['刘玄德','男','体育',60.],['关云长','男','数学',60.],['关云长','男','语文',100.]]
af=pd.DataFrame(a,columns=['name','sex','course','score'])
af

  name sex course  score
0  刘玄德   男     语文   98.0
1  刘玄德   男     体育   60.0
2  关云长   男     数学   60.0
3  关云长   男     语文  100.0

In [16]:
#通过set_index方法  可以设置单索引和复合索引
#DataFrame.set_index(keys,drop=True,append=False,inplace=False,verify_integrity=False)
#append添加新索引，drop为false  inplace为True  索引将会被还原为列

'''
reset_index 可以还原索引 重新变为默认的典型索引
DataFrame.reset_index
level  是控制具体要还原的那个等级的索引
drop为false则索引列会被还原成普通列  否则丢失
'''
af.set_index(['name','sex','course'],inplace=True)
af

                 score
name sex course
刘玄德  男   语文       98.0
         体育       60.0
关云长  男   数学       60.0
         语文      100.0

In [17]:
t1=af.unstack(level=2)   #行转列
t1

         score
course      体育    数学     语文
name sex
关云长  男     NaN  60.0  100.0
刘玄德  男    60.0   NaN   98.0

In [21]:
t2=af.unstack(level=1)
t2

             score
sex              男
name course
关云长  数学       60.0
     语文      100.0
刘玄德  体育       60.0
     语文       98.0

In [23]:
t3=af.unstack(level=0)
t3

            score
name          关云长   刘玄德
sex course
男   体育        NaN  60.0
    数学       60.0   NaN
    语文      100.0  98.0

In [24]:
t2=t1.mean(axis=1,skipna=True)  #算平均数
t2

name  sex
关云长   男      80.0
刘玄德   男      79.0
dtype: float64

In [25]:
t1['平均分']=t2   #给t1增加平均分列
t1

         score                平均分
course      体育    数学     语文
name sex
关云长  男     NaN  60.0  100.0  80.0
刘玄德  男    60.0   NaN   98.0  79.0

In [26]:
t1.fillna(0)

         score                平均分
course      体育    数学     语文
name sex
关云长  男     0.0  60.0  100.0  80.0
刘玄德  男    60.0   0.0   98.0  79.0

In [27]:
#解决方案二：用pivot 和 pivot_table
#pivot(index,columns,values)  将index指定为行索引   columns是列索引  values则是DataFrame中的值
a=[['刘玄德','男','语文',98.],['刘玄德','男','体育',60.],['关云长','男','数学',60.],['关云长','男','语文',100.]]
af=pd.DataFrame(a,columns=['name','sex','course','score'])
af

  name sex course  score
0  刘玄德   男     语文   98.0
1  刘玄德   男     体育   60.0
2  关云长   男     数学   60.0
3  关云长   男     语文  100.0

In [28]:
af2=af.pivot('name','course','score')
af2

course    体育    数学     语文
name
关云长      NaN  60.0  100.0
刘玄德     60.0   NaN   98.0

In [30]:
af2['avg']=af2.mean(axis=1)
af2

course    体育    数学     语文   avg
name
关云长      NaN  60.0  100.0  80.0
刘玄德     60.0   NaN   98.0  79.0

In [32]:
af2.fillna(0.0)
af2   #不能填充

course    体育    数学     语文   avg
name
关云长      NaN  60.0  100.0  80.0
刘玄德     60.0   NaN   98.0  79.0

In [33]:
af2[af2.isnull()]=0
af2

course    体育    数学     语文   avg
name
关云长      0.0  60.0  100.0  80.0
刘玄德     60.0   0.0   98.0  79.0

In [34]:
#解法3  pivot_table 就是数据透现象
af3=af.pivot_table('score',index='name',columns='course',aggfunc='mean',margins=True,fill_value=0)
af3

course    体育    数学     语文   All
name
关云长      0.0  60.0  100.0  80.0
刘玄德     60.0   0.0   98.0  79.0
All     60.0  60.0   99.0  79.5